driver-tests/bpelse/benchmark/TransformationApp/test/TestCase2/Input.xml


<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rev="http://services.samples/xsd/reverse">
    <soapenv:Body>
        <rev:skcotSyub>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500</emulov>
            </redro>
            <redro>
                <lobmys>GOOG</lobmys>
                <DIreyub>chathura</DIreyub>
                <ecirp>60.24</ecirp>
                <emulov>40000</emulov>
            </redro>
            <redro>
                <lobmys>IBM</lobmys>
                <DIreyub>asankha</DIreyub>
                <ecirp>140.34</ecirp>
                <emulov>2000</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>MSFT</lobmys>
                <DIreyub>ruwan</DIreyub>
                <ecirp>23.56</ecirp>
                <emulov>8030</emulov>
            </redro>
            <redro>
                <lobmys>SUN</lobmys>
                <DIreyub>indika</DIreyub>
                <ecirp>14.56</ecirp>
                <emulov>500000000000000000000000000000</emulov>
            </redro>
        </rev:skcotSyub>
    </soapenv:Body>
</soapenv:Envelope>